Repository: norayr/mappero
Catalog: po/*.po
Languages: fi_fi, it_it

source: # POIs
fi_fi: # POI:t
it_it: # POI

source: %d seconds
fi_fi: %d sekuntia

source: 1 second
fi_fi: 1 sekunti

source: About
fi_fi: Tietoja

source: About %s
fi_fi: Tietoja %s:ta

source: About...
fi_fi: Tietoja
it_it: Informazioni...

source: Add Category
fi_fi: Lisää kategoria
it_it: Aggiungi categoria

source: Add POI
fi_fi: Lisää POI-piste
it_it: Aggiungi POI

source: Add POI...
fi_fi: Lisää POI-piste
it_it: Aggiungi POI...

source: Add Route Point
fi_fi: Lisää reittipiste
it_it: Aggiungi punto alla rotta

source: Add Waypoint
fi_fi: Lisää kohdepiste
it_it: Aggiungi Waypoint

source: Add Waypoint...
fi_fi: Lisää kohdepiste
it_it: Aggiungi Waypoint...

source: Add...
fi_fi: Lisää
it_it: Aggiungi...

source: Address
fi_fi: Osoite
it_it: Indirizzo

source: Address...
fi_fi: Osoitteeseen
it_it: Indirizzo...

source: Advance Notice
fi_fi: Ennakkovaroitus
it_it: Anticipo avvisi

source: Along Route - Radius (tiles):
fi_fi: Reitin varrelta - Säde:
it_it: Lungo la rotta - raggio (riquadri):

source: Altitude
fi_fi: Korkeus
it_it: Altitudine

source: Always landscape
fi_fi: Aina vaakatasossa

source: Always portrait
fi_fi: Aina pystytasossa

source: Announce
fi_fi: Opastus
it_it: Avviso

source: Area
fi_fi: Alue

source: Auto-Center
fi_fi: Automaattinen keskitys
it_it: Centro automatico

source: Auto-Center Off
fi_fi: Automaattinen keskitys pois päältä
it_it: Disabilita centro automatico

source: Auto-Download
fi_fi: Automaattinen nouto
it_it: Scaricamento automatico

source: Auto-Download Pre-cache
fi_fi: Karttojen hakualue
it_it: Scaricamento automatico pre-cache

source: Auto-Rotate
fi_fi: Automaattinen
it_it: Rotazione automatica

source: Auto-Update
fi_fi: Automaattinen päivitys
it_it: Aggiornamento automatico

source: Automatic
fi_fi: Automaattinen

source: Bear.
fi_fi: Suunt.
it_it: Direzione.

source: Bottom-Left
fi_fi: Ala-vasen
it_it: Inferiore sinistro

source: Bottom-Right
fi_fi: Ala-oikea
it_it: Inferiore destra

source: Browse POI...
fi_fi: Selaa POI-pisteitä
it_it: Mostra POI...

source: Browse POIs
fi_fi: Selaa POI-pisteitä
it_it: Mostra i POI

source: Browse...
fi_fi: Selaa
it_it: Mostra...

source: Bus stops, airports, train stations, etc.
fi_fi: Bussi- ja rautatieasemat, lentokentät ym.
it_it: Fermate bus, aereoporti, stazioni ecc.

source: Business
fi_fi: Liike-elämä
it_it: Affari

source: By Area (see tab)
fi_fi: Alueelta (katso välilehti)
it_it: Per area (vedi scheda)

source: Cache dir
fi_fi: Kansion nimi

source: Cache dir is required
fi_fi: Tallennuskansio vaaditaan

source: Categories...
fi_fi: Kategoriat
it_it: Categorie...

source: Category
fi_fi: Kategoria
it_it: Categoria

source: Checked POI Actions...
fi_fi: Toiminnot valituille POI:lle
it_it: Azioni POI selezionate...

source: Clear
fi_fi: Poista
it_it: Cancella

source: Colors
fi_fi: Värit
it_it: Colori

source: Colors...
fi_fi: Värit
it_it: Colori...

source: Compass Rose
fi_fi: Kompassiruusu
it_it: Rosa dei venti

source: Confirm DELETION of
fi_fi: Vahvista
it_it: Conferma eliminazione di

source: Confirm delete of waypoint
fi_fi: Vahvista kohdepisteen poisto
it_it: Conferma l'eliminazione del waypoint

source: Confirm download of
fi_fi: Vahvista
it_it: Conferma il download di

source: Copy
fi_fi: Kopioi
it_it: Copia

source: Copy Description
fi_fi: Kopioi kuvaus
it_it: Copia descrizione

source: Copy Position
fi_fi: Kopioi sijainti

source: Creating a "waypoint" with no description actually adds a break point. Is that what you want?
fi_fi: Luotaessa "kohdepiste" ilman kuvausta, lisää itseasiassa katkaisupisteen. Oliko se tarkoitus?
it_it: La creazione di un waypoint senza descrizione inserisce una sosta. È quello che intendi fare?

source: Default Category
fi_fi: Oletus kategoria
it_it: Categoria predefinita

source: Degrees Format
fi_fi: Asteiden muoto
it_it: Formato gradi

source: Delete Maps
fi_fi: Poista kartat
it_it: Elimina mappe

source: Delete POI?
fi_fi: Poista POI?
it_it: Elimina POI?

source: Delete category?
fi_fi: Poista kategoria?
it_it: Elimina categoria?

source: Delete selected POI?
fi_fi: Poista valittu POI?
it_it: Elimina POI selezionati?

source: Delete...
fi_fi: Poista
it_it: Elimina...

source: Description
fi_fi: Kuvaus
it_it: Descrizione

source: Destination
fi_fi: Kohde
it_it: Destinazione

source: Disabled
fi_fi: Ei käytössä

source: Dist.
fi_fi: Etäis.

source: Distance
fi_fi: Etäisyys
it_it: Distanza

source: Do you really want to delete repository %s?
fi_fi: Haluatko varmasti poistaa karttavaraston %s?

source: Do you really want to delete tile source %s?
fi_fi: Haluatko varmasti poistaa karttapalojen %s lähteen?

source: Donate
fi_fi: Lahjoita

source: Download Maps
fi_fi: Lataa kartat
it_it: Scaricamento mappe

source: Download POI...
fi_fi: Lataa POI-pisteet
it_it: Scaricamento POI...

source: Download POIs
fi_fi: Lataa POI-pisteet
it_it: Scaricamento POI

source: Download...
fi_fi: Lataa internetistä
it_it: Scarica...

source: Edit Categories...
fi_fi: Muokkaa kategorioita
it_it: Modifica categorie

source: Edit Category
fi_fi: Muokkaa kategoriaa
it_it: Modifica categoria

source: Edit POI
fi_fi: Muokkaa POI-pistettä
it_it: Modifica POI

source: Edit...
fi_fi: Muokkaa
it_it: Modifica...

source: Elementary schools, college campuses, etc.
fi_fi: Peruskoulut, lukiot, ym.
it_it: Scuole primarie, college ecc.

source: Enable Tracking
fi_fi: Reittijälki käytössä

source: Enable Waypoint Announcements
fi_fi: Kohdepisteen ilmoitukset käytössä

source: Enable voice announcements
fi_fi: Käytä puheopasteita

source: Enabled
fi_fi: Käytössä
it_it: Abilitato

source: Enter your destination
fi_fi: Syötä kohdeosoite

source: Error adding POI
fi_fi: Virhe POI:n lisäyksessä
it_it: Problema aggiungendo il POI

source: Error adding category
fi_fi: Virhe kategorian lisäyksessä
it_it: Problema aggiungendo la categoria

source: Error deleting POI
fi_fi: Virhe POI:n poistossa
it_it: Errore rimuovendo il POI

source: Error deleting category
fi_fi: Virhe kategorian poistossa
it_it: Errore rimuovendo la categoria

source: Error parsing GPX file.
fi_fi: Virhe tulkittaessa GPX-tiedostoa.
it_it: Errore analizzando il file GPX.

source: Error saving map to disk - disk full?
fi_fi: Virhe kartan tallennuksessa - levy täynnä?

source: Error updating Category
fi_fi: Virhe kategorian päivityksessä
it_it: Errore aggiornando la categoria

source: Error updating POI
fi_fi: Virhe POI:n päivityksessä
it_it: Errore aggiornando il POI

source: Error updating category
fi_fi: Virhe kategorian päivityksessä
it_it: Errore aggiornando la categoria

source: Error with POI database
fi_fi: Virhe POI-tietokannassa
it_it: Errore con il database dei POI

source: Error writing GPX file.
fi_fi: Virhe kirjoitettaessa GPX-tiedostoa.
it_it: Errore scrivendo il file GPX.

source: Establishing GPS fix
fi_fi: Odotetaan GPS:n lukittumista
it_it: Connessione con il GPS in corso

source: Estimated
fi_fi: Arvioitu
it_it: Stimato

source: Export to GPX...
fi_fi: Vie GPX-tiedostoksi
it_it: Esporta in GPX...

source: Failed to connect to GPX Directions server
fi_fi: Yhteyden muodostus GPX-reittipalvelimeen epäonnistui
it_it: Impossibile connettersi al server delle indicazioni GPX

source: Failed to initialize GConf. Quitting.
fi_fi: GConf alustus epäonnistui. Lopetetaan.
it_it: Impossibile inizializzare GConf. Esco.

source: Failed to initialize GConf. Settings were not saved.
fi_fi: GConf alustus epäonnistui. Asetuksia ei tallennettu.
it_it: Impossibile inizializzare GConf. Le impostazioni non sono state salvate.

source: Failed to open file for reading
fi_fi: Tiedoston avaus lukemista varten epäonnistui
it_it: Impossibile aprire il file per lettura

source: Failed to open or create database
fi_fi: Tietokannan avaus tai luonti epäonnistui
it_it: Impossibile aprire o creare il database

source: Failed to open path database. Tracks and routes will not be saved.
fi_fi: Reittitietokannan avaus epäonnistui. Reittisuunnitelmaa ja -jälkeä ei tallennettu.
it_it: Errore aprendo il database dei percorsi. Tracce e rotte non saranno salvate.

source: Failed to write to path database. Tracks and routes may not be saved.
fi_fi: Tietojen tallennus reittitietokantaan epäonnistui. Reittisuunnitelmaa ja -jälkeä ei tallennettu.
it_it: Errore scrivendo il database dei percorsi. Tracce e rotte non saranno salvate.

source: Find route
fi_fi: Etsi reitti

source: Find route to...
fi_fi: Etsi reitti kohteeseen

source: Fix
fi_fi: Lukitus
it_it: Posizione

source: Fix Quality
fi_fi: Lukituksen laatu
it_it: Qualità posizione

source: Fixed
fi_fi: Kiinteä
it_it: Posizione acquisita

source: Float RTK
fi_fi: Kelluva RTK

source: Format
fi_fi: Muoto
it_it: Formato

source: GPS Details
fi_fi: GPS:n yksityiskohdat
it_it: Dettagli GPS

source: GPS Details...
fi_fi: GPS:n yksityiskohdat

source: GPS Information
fi_fi: GPS-tiedot
it_it: Informazioni GPS

source: GPS Location
fi_fi: GPS-sijaintiin
it_it: Località GPS

source: GPS polling interval
fi_fi: GPS:n päivitysväli

source: GPS status
fi_fi: GPS:n tila

source: General landmarks.
fi_fi: Yleiset maamerkit.
it_it: Generale - territorio.

source: General places of business.
fi_fi: Yleiset liike-elämän kohteet.
it_it: Generale - affari.

source: Geographical mapping and driving directions
fi_fi: Karttaohjelma opastavalla navigoinnilla

source: Go to
fi_fi: Siirry
it_it: Vai a

source: Go to Address
fi_fi: Siirry osoitteeseen
it_it: Vai all'indirizzo

source: Go to Lat/Lon
fi_fi: Siirry Lat/Lon
it_it: Vai a Lat/Lon

source: Heading
fi_fi: Suunta
it_it: Direzione

source: Houses, apartments, or other residences of import.
fi_fi: Talot, asunnot tai muut asuinpaikat.
it_it: Case appartamenti o altre residenze.

source: ID is not unique
fi_fi: ID ei ole yksilöllinen

source: ID is required
fi_fi: ID vaaditaan

source: Import...
fi_fi: Tuo tiedostosta
it_it: Importa...

source: Indoor or Outdoor places to have fun.
fi_fi: Sisä- tai ulkotiloja hauskanpitoon.
it_it: Luoghi di divertimento.

source: Info Font Size
fi_fi: Tietojen kirjasinkoko
it_it: Dimensione carattere Informazioni

source: Insert Break
fi_fi: Lisää katkaisupiste
it_it: Inserisci sosta

source: Insert Mark
fi_fi: Lisää merkki
it_it: Inserisci segnale

source: Insert Mark...
fi_fi: Lisää merkki
it_it: Inserisci segnale...

source: Invalid Bottom-Right coordinate specified
fi_fi: Virheellinen ala-oikea koordinaatti

source: Invalid Coordinate specified
fi_fi: Virheellinen koordinaatti annettu

source: Invalid Latitude
fi_fi: Virheellinen latitudi
it_it: Latitudine errata

source: Invalid Longitude
fi_fi: Virheellinen longitudi
it_it: Longitudine errata

source: Invalid Top-Left coordinate specified
fi_fi: Virheellinen ylä-vasen koordinaatti

source: Invalid address.
fi_fi: Virheellinen osoite
it_it: Indirizzo non valido.

source: Invalid origin or query.
fi_fi: Virheellinen lähde tai kysely.
it_it: Interrogazione o origine non valida.

source: Label
fi_fi: Nimike
it_it: Etichetta

source: Landmark
fi_fi: Maamerkki
it_it: Punto di riferimento sul territorio

source: Latitude
fi_fi: Latitudi
it_it: Latitudine

source: Layer
fi_fi: Taso

source: Layers
fi_fi: Tasot

source: Layers: %d new, %d updated Repositories: %d new, %d updated
fi_fi: Tasot: %d uutta, %d päivitettyä Karttavarastot: %d uutta, %d päivitettyä

source: Lead
fi_fi: Etumatka
it_it: Anticipo

source: Lead Amount
fi_fi: Etumatkan määrä
it_it: Lunghezza anticipo

source: Line Width
fi_fi: Viivanleveys
it_it: Spessore linea

source: Local time
fi_fi: Paikallisaika
it_it: Ora locale

source: Location
fi_fi: Sijainti
it_it: Località

source: Lodging
fi_fi: Majapaikka

source: Longitude
fi_fi: Longitudi
it_it: Longitudine

source: Manage Maps
fi_fi: Karttojen hallinta
it_it: Gestisci mappe

source: Manage Maps...
fi_fi: Karttojen hallinta
it_it: Gestisci mappe...

source: Manual
fi_fi: Manuaalinen
it_it: Manuale

source: Map Point
fi_fi: Kartan piste

source: Map repository
fi_fi: Karttavarasto

source: Maps
fi_fi: Kartat
it_it: Mappe

source: Max speed
fi_fi: Maksiminopeus
it_it: Velocità massima

source: Max zoom
fi_fi: Maksimi zoom

source: Min zoom
fi_fi: Minimi zoom

source: Min. Speed
fi_fi: Miniminopeus
it_it: Velocità minima

source: Misc.
fi_fi: Sekalaiset
it_it: Varie

source: Miscellaneous category for everything else.
fi_fi: Sekalainen kategoria kaikelle muulle.
it_it: Categorie miste

source: Name
fi_fi: Nimi
it_it: Nome

source: Name is required
fi_fi: Nimi vaaditaan

source: Nearest POI
fi_fi: Lähimpään POI-pisteeseen
it_it: POI più vicino

source: Never
fi_fi: Ei koskaan

source: New repository
fi_fi: Uusi karttavarasto

source: Next Waypoint
fi_fi: Seuraavaan kohdepisteeseen
it_it: Prossimo waypoint

source: No POIs found.
fi_fi: POI-pistettä ei löytynyt.
it_it: Nessun POI trovato.

source: No POIs were found.
fi_fi: POI-pisteitä ei löytynyt.
it_it: Nessun POI trovato.

source: No changes in repositories
fi_fi: Ei muutoksia karttavarastoissa

source: None
fi_fi: Ei keskitystä
it_it: Nessuno

source: Open...
fi_fi: Avaa
it_it: Apri...

source: Options
fi_fi: Asetukset

source: Orientation
fi_fi: Suuntaus

source: Origin
fi_fi: Lähde
it_it: Partenza

source: Other
fi_fi: Muu
it_it: Altro

source: Other...
fi_fi: Muut

source: Overwrite
fi_fi: Ylikirjoita
it_it: Sovrascrivi

source: Overwrite query with the following text?
fi_fi: Ylikirjoita tekstihaku seuraavalla tekstillä?
it_it: Sovrascrivo l'interrogazione con il testo che segue?

source: POI
fi_fi: POI-pisteet

source: POI Categories
fi_fi: POI-kategoriat
it_it: Categorie POI

source: POI List
fi_fi: POI-lista
it_it: Elenco POI

source: POI database
fi_fi: POI tietokanta
it_it: Database POI

source: POIs Exported
fi_fi: POI-pistettä viety.
it_it: POI esportati

source: POIs were added to the POI database. The following screen will allow you to modify or delete any of the new POIs.
fi_fi: POI-pistettä lisättiin tietokantaan. Voit muokata tai poistaa mitä tahansa POI-pisteitä seuraavassa valintaikkunassa.
it_it: I POI sono stati aggiunti al database dei POI. La schermata seguente ti permette di modificare o cancellare tutti i nuovi POI.

source: Page
fi_fi: Sivu
it_it: Pagina

source: Pan Sensitivity
fi_fi: Vieritysherkkyys
it_it: Sensibilità scorrimento

source: Places to eat or drink.
fi_fi: Baarit ja ruokailupaikat.
it_it: Luoghi dove bere o mangiare.

source: Places to shop or acquire services.
fi_fi: Kaupat ja palvelut.
it_it: Luoghi dove acquistare beni o servizi.

source: Places to stay temporarily or for the night.
fi_fi: Paikat väliaikaiseen yöpymiseen.
it_it: Luoghi dove pernottare.

source: Please provide a description for the mark.
fi_fi: Anna merkille kuvaus.
it_it: Specifica una descrizione per il POI.

source: Please specify a category.
fi_fi: Määrittele kategoria.
it_it: Specifica una categoria.

source: Please specify a default category.
fi_fi: Määrittele oletuskategoria.
it_it: Specifica una categoria predefinita.

source: Please specify a name for the category.
fi_fi: Määrittele kategorian nimi.
it_it: Specifica un nome per la categoria.

source: Please specify a name.
fi_fi: Määrittele nimi.
it_it: Specifica un nome.

source: Please specify a query.
fi_fi: Määrittele kysely.
it_it: Specifica un'interrogazione.

source: Please specify a source URL.
fi_fi: Määrittele lähde URL.
it_it: Specifica un URL.

source: Please specify a start location.
fi_fi: Määrittele lähtöpiste.
it_it: Indica una località di partenza.

source: Please specify an end location.
fi_fi: Määrittele kohdepiste.
it_it: Indica una località di arrivo.

source: Please specify an origin.
fi_fi: Määrittele lähtöpiste.
it_it: Specifica un'origine.

source: Processing Maps
fi_fi: Käsitellään karttoja
it_it: Elaborazione mappe

source: Query
fi_fi: Kysely
it_it: Interrogazione

source: Really clear the track?
fi_fi: Haluatko varmasti tyhjentää reittijäljen?
it_it: Vuoi veramente cancellare la traccia?

source: Recalculating directions...
fi_fi: Lasketaan reittiä...
it_it: Sto ricalcolando le direzioni...

source: Recreation
fi_fi: Harrastuspaikka
it_it: Tempo libero

source: Reduce GPS usage on screen off
fi_fi: Vähennä GPS:n käyttöä sammutetulla näytöllä

source: Refresh, min
fi_fi: Päivitä, min

source: Report bug
fi_fi: Ilmoita virheestä

source: Repositories
fi_fi: Karttavarastot
it_it: Depositi

source: Repository
fi_fi: Karttavarasto

source: Repository's layers
fi_fi: Karttavaraston tasot

source: Reset
fi_fi: Aseta alkutilaan
it_it: Reimposta

source: Reset all colors to their original defaults?
fi_fi: Korvataanko kaikki värit oletusväreillä?
it_it: Reimposto tutti i colori con quelli predefiniti?

source: Reset...
fi_fi: Palauta alkutilaan
it_it: Reimposta...

source: Residence
fi_fi: Asunto

source: Restaurant
fi_fi: Ravintola
it_it: Ristorante

source: Route
fi_fi: Reittisuunnitelma
it_it: Rotta

source: Route Opened
fi_fi: Reittisuunnitelma avattu
it_it: Rotta aperta

source: Route Saved
fi_fi: Reittisuunnitelma tallennettu
it_it: Rotta salvata

source: Router
fi_fi: Reititin

source: Routes are now hidden
fi_fi: Reitit on nyt piilotettu
it_it: Le rotte sono nascoste

source: Routes are now shown
fi_fi: Reitit on nyt näkyvissä
it_it: Le rotte sono visibili

source: Sat in use
fi_fi: Satelliitteja käytössä
it_it: Satelliti in uso

source: Sat in view
fi_fi: Satelliitteja näkyy
it_it: Satelliti in vista

source: Satellites details
fi_fi: Satelliittien yksityiskohdat
it_it: Dettagli satelliti

source: Satellites in view
fi_fi: Satelliitteja näkyvissä
it_it: Satelliti in vista

source: Save...
fi_fi: Tallenna
it_it: Salva...

source: Scale
fi_fi: Asteikko
it_it: Scala

source: School
fi_fi: Koulu
it_it: Scuola

source: Select POI
fi_fi: Valitse POI
it_it: Seleziona POI

source: Select an operation to perform on the POIs that you checked in the POI list.
fi_fi: Valitse suoritettava toiminto POI-listasta valituille pisteille.
it_it: Scegli un'operazione da eseguire sui POI che hai selezionato nell' elenco dei POI.

source: Select one POI from the list.
fi_fi: Valitse yksi POI listalta.
it_it: Scegli un POI dalla lista.

source: Select point
fi_fi: Valitse piste

source: Selected layer is active, so, cannot be deleted.
fi_fi: Valittua tasoa ei voi poistaa koska se on aktiivinen.

source: Service Station
fi_fi: Huoltoasema
it_it: Stazione di servizio

source: Set Category...
fi_fi: Aseta kategoria
it_it: Imposta categoria...

source: Set as GPS Location
fi_fi: Aseta GPS-sijainniksi
it_it: Usa la località del GPS

source: Set destination...
fi_fi: Aseta kohde

source: Settings
fi_fi: Asetukset
it_it: Impostazioni

source: Settings...
fi_fi: Asetukset
it_it: Impostazioni...

source: Setup
fi_fi: Valinnat
it_it: Impostazioni

source: Shopping/Services
fi_fi: Kauppa / Palvelu
it_it: Shopping/Servizi

source: Show
fi_fi: Näytä
it_it: Mostra

source: Show Description
fi_fi: Näytä kuvaus
it_it: Mostra descrizione

source: Show Distance to
fi_fi: Näytä etäisyys kohteeseen
it_it: Mostra la distanza verso

source: Show POI below zoom
fi_fi: Näytä POI-pisteet alle zoom-tason
it_it: Mostra POI con zoom

source: Show Position
fi_fi: Näytä sijainti
it_it: Mostra posizione

source: Simulation
fi_fi: Simulaatio
it_it: Simulazione

source: Source URL
fi_fi: Lähde-URL
it_it: Fonte URL

source: Speed
fi_fi: Nopeus
it_it: Velocità

source: Speed Limit
fi_fi: Nopeusvaroitus
it_it: Limite di velocità

source: Speed based
fi_fi: Nopeuspohjainen

source: Starting point
fi_fi: Lähtöpiste

source: Stations for purchasing fuel for vehicles.
fi_fi: Huoltoasemat ja autokorjaamot.
it_it: Stazioni di servizio.

source: Tap a point on the map
fi_fi: Kosketa haluttua kohtaa kartalla

source: There is no next waypoint.
fi_fi: Seuraava kohdepiste puuttuu.
it_it: Non c'è un waypoint successivo.

source: This application is free software. Support its development by contributing code, accurate bug reporting or donating money. 2009-2010 Alberto Mardegan 2009-2010 Max Lapan 2006-2009 John Costigan
fi_fi: Tämä on vapaa ohjelma. Tue ohjelman kehitystä sitä edelleen kehittämällä, tarkoilla virheraporteilla tai rahalahjoituksilla. 2009-2010 Alberto Mardegan 2009-2010 Max Lapan 2006-2009 John Costigan

source: Tile source
fi_fi: Kartan lähde

source: Tile source is required
fi_fi: Kartan lähde vaaditaan

source: Tiles
fi_fi: Karttapalat

source: Tiles and layers
fi_fi: Karttapalat ja tasot

source: Top-Left
fi_fi: Ylä-vasen
it_it: Superiore sinistra

source: Top-Right
fi_fi: Ylä-oikea
it_it: Superiore destro

source: Track
fi_fi: Reittijälki
it_it: Percorso

source: Track Opened
fi_fi: Reittijälki avattu
it_it: Percorso aperto

source: Track Saved
fi_fi: Reittijälki tallennettu
it_it: Percorso salvato

source: Tracking Disabled
fi_fi: Reittijälki pois käytöstä

source: Tracking Enabled
fi_fi: Reittijälki käytössä

source: Tracks are now hidden
fi_fi: Reittijäljet on nyt piilotettu
it_it: I percorsi sono nascosti

source: Tracks are now shown
fi_fi: Reittijäljet on nyt nähtävissä
it_it: I percorsi sono visibili

source: Transportation
fi_fi: Liikenne
it_it: Trasporti

source: Type
fi_fi: Tyyppi

source: URL is required
fi_fi: URL vaaditaan

source: Unblank Screen
fi_fi: Näytön päälläolo
it_it: Attiva schermo

source: Units
fi_fi: Yksiköt
it_it: Unità

source: Unknown error while locating address.
fi_fi: Tunnistamaton virhe osoitetta etsittäessä.
it_it: Errore sconosciuto mentre cerco l'indirizzo.

source: Use End of Route
fi_fi: Käytä reitin loppupistettä
it_it: Usa la fine della rotta

source: Use GPS Location
fi_fi: Käytä GPS-sijaintia
it_it: Usa la località del GPS

source: Velocity Vector
fi_fi: Nopeusvektori
it_it: Vettore di velocità

source: View
fi_fi: Näytä
it_it: Vista

source: View Center
fi_fi: Näytä keskusta
it_it: Mostra centro

source: View/Edit...
fi_fi: Näytä/Muokkaa
it_it: Mostra/Modifica...

source: Visit website
fi_fi: Vieraile web-sivulla

source: WARNING: All POIs in that category will also be deleted!
fi_fi: VAROITUS: Kaikki POI-pisteet tässä kategoriassa poistetaan!
it_it: ATTENZIONE: tutti i POI in questa categoria verranno eliminati!

source: Waypoint
fi_fi: Kohdepiste

source: When Approaching a Waypoint
fi_fi: Lähestyttäessä kohdepistettä

source: When Moving
fi_fi: Liikuttaessa

source: When Moving (Full Screen Only)
fi_fi: Liikuttaessa (vain koko näyttö)

source: When Receiving Any GPS Data
fi_fi: Vastaanotettaessa sijaintitietoja

source: Zoom Level
fi_fi: Zoom-taso
it_it: Livello di zoom

source: Zoom Levels to Download: (0 = most detail)
fi_fi: Ladattavat zoom-tasot : (0 = tarkin)
it_it: Livelli di Zoom da scaricare: (0 = massimo dettaglio)

source: Zoom step
fi_fi: Zoom-taso

source: about
fi_fi: noin
it_it: circa

source: in use
fi_fi: käytössä
it_it: in uso

source: km
fi_fi: kilometrit

source: maps
fi_fi: kartan palan lataus
it_it: mappe

source: maps
fi_fi: kartan palan poisto
it_it: mappe

source: maps failed to download.
fi_fi: karttojen lataus epäonnistui.
it_it: impossibile scaricare le mappe.

source: mi.
fi_fi: mailit

source: n.m.
fi_fi: merimailit

source: nofix
fi_fi: ei lukitusta

source: Real Time Kinematic
it_it: Movimento in tempo reale

source: none
it_it: nessuna
